Revit 2026 API

# MaterialSurfaceBackgroundPatternColor Property

---

The color of the material surface background pattern.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color SurfaceBackgroundPatternColor { get; set; }
```
```vb
Public Property SurfaceBackgroundPatternColor As Color
	Get
	Set
```
```cpp
public:
property Color^ SurfaceBackgroundPatternColor {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member SurfaceBackgroundPatternColor : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Material Class

Autodesk.Revit.DB Namespace